# 2. 改写之前的学生信息管理项目源码，要求带有操作界面：
#     +------------------------------+
#     | 1)添加学生信息                 |
#     | 2)显示所有学生的信息            |
#     | 3)删除学生信息                 |
#     | 4)修改学生成绩                 |
#     | 5)按学生成绩高-低显示学生信息    |
#     | 6)按学生成绩低-高显示学生信息    |
#     | 7)按学生年龄高-低显示学生信息    |
#     | 8)按学生年龄低-高显示学生信息    |
#     | q)退出                        |
#     +------------------------------+
#     请选择：
#     要求每个功能至少写一个函数与之相对应



def show_menu():
    print('+-----------------------------------+')
    print('| 1)  添加学生信息                  |')
    print('| 2)  显示所有学生的信息            |')
    print('| 3)  删除学生信息                  |')
    print('| 4)  修改学生成绩                  |')
    print('| 5)  按学生成绩高-低显示学生信息   |')
    print('| 6)  按学生成绩低-高显示学生信息   |')
    print('| 7)  按学生年龄高-低显示学生信息   |')  
    print('| 8)  按学生年龄低-高显示学生信息   |')
    print('| 9)  保存学生信息                  |')
    print('|10)  读取学生信息                  |')
    print('| q)  退出                          |')
    print('+-----------------------------------+')






